In [2]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({
    'Name': ['Ram','Mohan','David'],
    'Age': [27,29,30],
    'Income': [70000,90000,61000]
})

In [6]:
df

    Name  Age  Income
0    Ram   27   70000
1  Mohan   29   90000
2  David   30   61000

In [9]:
df_drop =df.drop(['Age'],axis=1)

In [11]:
df_drop

    Name  Income
0    Ram   70000
1  Mohan   90000
2  David   61000

In [13]:
df_drop_age_incom = df.drop(['Age','Income' ], axis=1)

In [15]:
df_drop_age_incom

    Name
0    Ram
1  Mohan
2  David

In [17]:
df_1 = df.drop([1])

In [19]:
df_1

    Name  Age  Income
0    Ram   27   70000
2  David   30   61000

In [21]:
df

    Name  Age  Income
0    Ram   27   70000
1  Mohan   29   90000
2  David   30   61000

In [24]:
df['Income'].apply(np.sqrt)

0    264.575131
1    300.000000
2    246.981781
Name: Income, dtype: float64

In [27]:
l_position = df['Name'].apply(lambda x : 'Manager' if x is 'Mohan' else 'Software Developer')

In [29]:
pd.concat([df,l_position],axis=1)

    Name  Age  Income                Name
0    Ram   27   70000  Software Developer
1  Mohan   29   90000             Manager
2  David   30   61000  Software Developer

In [31]:
df

    Name  Age  Income
0    Ram   27   70000
1  Mohan   29   90000
2  David   30   61000

In [34]:
name_dummies = pd.get_dummies(df['Name'], drop_first=True)
name_dummies

   Mohan  Ram
0      0    1
1      1    0
2      0    0

In [36]:
df_1 = pd.concat([df,name_dummies],axis=1)

In [38]:
df_1

    Name  Age  Income  Mohan  Ram
0    Ram   27   70000      0    1
1  Mohan   29   90000      1    0
2  David   30   61000      0    0

In [40]:
df_2= df_1.drop(['Name'],axis=1)

In [41]:
df_2

   Age  Income  Mohan  Ram
0   27   70000      0    1
1   29   90000      1    0
2   30   61000      0    0